app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = 3 LIMIT 1
INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES ('Ryan', 'Nicememe', 3, '2017-04-29 03:31:04.462000', '2017-04-29 03:31:04.462000')
---
	def create
		@post = Post.find(params[:post_id])

		if @post.comments.create(comment_params)