app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author", "title", "body", "created_at", "updated_at") VALUES ('Ryan', 'REEE', 'screeching', '2017-04-29 03:51:53.342000', '2017-04-29 03:51:53.342000')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = 'REEEEEEEEEE', "updated_at" = '2017-04-28 03:57:17.448000' WHERE "posts"."id" = 3